dck982/coffeeflow/firmware/screen/sdkconfig.defaults
# Défauts de projet — module écran (Waveshare ESP32-S3-Touch-LCD-4.3,
# flash 16 Mo, 8 Mo PSRAM). Complète, ne remplace pas, la config par défaut
# d'ESP-IDF v5.1 (voir firmware/IDF_VERSION.md).

CONFIG_IDF_TARGET="esp32s3"

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM 8 Mo, nécessaire pour le framebuffer RGB 800x480 (phase 6, LVGL).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Les allocations ordinaires de plus de 4 Kio préfèrent la PSRAM. Les
# allocations explicitement DMA/internal (bounce buffers, contrôleurs et
# piles FreeRTOS) continuent d'utiliser la réserve interne de 32 Kio.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# LVGL (lot 2, docs/plan-phase6.md) : police montserrat pour le titre de
# l'écran de service, le reste des labels utilise la police par défaut.
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_FONT_COMPRESSED=y

# Rollback applicatif : voir sensors/sdkconfig.defaults, même mécanisme.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

CONFIG_ESP_TASK_WDT_EN=y

CONFIG_TWAI_SUPPRESS_DEPRECATE_WARN=y

# Client GATT Acaia (lot 8). NimBLE est plus petit que Bluedroid et suffit au
# rôle central BLE.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
# Un seul client Acaia, sans rôle serveur ni appairage : les pools NimBLE ne
# doivent pas concurrencer en DRAM interne les bounce buffers RGB et Wi-Fi.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_INTERNAL=n
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_NIMBLE_GATT_SERVER=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n
CONFIG_BT_NIMBLE_HS_PVCY=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=6
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_ACL_FROM_LL_COUNT=12
CONFIG_BT_NIMBLE_TRANSPORT_EVT_COUNT=15
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=23
# Les optimisations IRAM Wi-Fi restent allouées même quand le driver est
# arrêté. Avec le contrôleur BLE lié, elles ne laissent plus assez de DIRAM
# pour les deux bounce buffers RGB de 64 KiB. Le mode Wi-Fi est un mode de
# service (HTTP/OTA), pour lequel le débit maximal ne justifie pas ~27 KiB
# d'IRAM permanente. NimBLE peut lui aussi privilégier la mémoire au débit.
CONFIG_BT_NIMBLE_LOW_SPEED_MODE=y
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# Console désactivée (primaire ET secondaire) : UART0 est piloté directement
# par le pont série<->CAN via son driver bas niveau (pas le port USB natif,
# voir le commentaire en tête de main.cpp — câblage réel de ce banc) ; sans
# ça, la console ESP-IDF se dispute UART0 avec notre driver.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# CONFIG_LCD_RGB_RESTART_IN_VSYNC essayé puis abandonné (2026-09-09,
# diagnostic glitch résiduel lot 2) : résultat nettement pire (sauts
# verticaux du contenu en plus du glitch existant). Ne pas réessayer sans
# comprendre pourquoi ce panneau/driver y réagit mal.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_WS_PRE_HANDSHAKE_CB_SUPPORT=y
CONFIG_HTTPD_WS_POST_HANDSHAKE_CB_SUPPORT=y
